lsh1315/UDINGO_STM32/main_stm.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"
#include "libjpeg.h"
#include "app_touchgfx.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32h7b3i_discovery_ospi.h"
#include "gui_bridge.h"
#include <stdio.h>
#include <string.h>
#include "parking_lot.h"
#include "path_planning.h"
#include "position_detection.h"
#include "server_communication.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

CRC_HandleTypeDef hcrc;

DMA2D_HandleTypeDef hdma2d;

I2C_HandleTypeDef hi2c4;

JPEG_HandleTypeDef hjpeg;
MDMA_HandleTypeDef hmdma_jpeg_infifo_th;
MDMA_HandleTypeDef hmdma_jpeg_outfifo_th;

LTDC_HandleTypeDef hltdc;

OSPI_HandleTypeDef hospi1;

SPI_HandleTypeDef hspi2;

UART_HandleTypeDef huart4;
UART_HandleTypeDef huart1;

SDRAM_HandleTypeDef hsdram1;

/* Definitions for defaultTask */
osThreadId_t defaultTaskHandle;
const osThreadAttr_t defaultTask_attributes = {
  .name = "defaultTask",
  .stack_size = 128 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for GUI_Task */
osThreadId_t GUI_TaskHandle;
const osThreadAttr_t GUI_Task_attributes = {
  .name = "GUI_Task",
  .stack_size = 8192 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for videoTask */
osThreadId_t videoTaskHandle;
const osThreadAttr_t videoTask_attributes = {
  .name = "videoTask",
  .stack_size = 1000 * 4,
  .priority = (osPriority_t) osPriorityLow,
};
/* Definitions for UWB */
osThreadId_t UWBHandle;
const osThreadAttr_t UWB_attributes = {
  .name = "UWB",
  .stack_size = 512 * 4,
  .priority = (osPriority_t) osPriorityBelowNormal,
};
/* Definitions for PathPlanning */
osThreadId_t PathPlanningHandle;
const osThreadAttr_t PathPlanning_attributes = {
  .name = "PathPlanning",
  .stack_size = 512 * 4,
  .priority = (osPriority_t) osPriorityLow,
};
/* Definitions for PrintDebug */
osThreadId_t PrintDebugHandle;
const osThreadAttr_t PrintDebug_attributes = {
  .name = "PrintDebug",
  .stack_size = 1024 * 4,
  .priority = (osPriority_t) osPriorityNormal,
};
/* USER CODE BEGIN PV */
FMC_SDRAM_CommandTypeDef command;

uint8_t buffer;
uint8_t CR = '\n';
char str[50];

// 전역 변수 선언
uint8_t lot_number;                     // 현재 주차장 번호를 저장
uint8_t **map_matrix = NULL;            // 주차장 지도를 나타내는 2D 배열 (동적 할당)
uint8_t map_rows, map_cols;             // 주차장 지도의 행과 열 크기
uint8_t user_preference[2];             // 사용자 선호도: [주차 구역 유형, 기준]
                                        // 유형: 2(경차), 3(장애인), 4(일반), 5(전기차)
                                        // 기준: 1(입구 근처), 2(출구 근처), 3(마트 출입구 근처)
uint8_t position[2] = {54, 24};                    // 현재 차량의 위치 [행, 열]
uint8_t path[100][2];        // A* 알고리즘으로 계산된 최적 경로를 저장하는 배열
uint8_t path_length;                    // 최적 경로의 길이
uint8_t goal[2];                        // 최종 목적지 주차 공간의 좌표 [행, 열]

typedef enum {
    STATE_WAIT_FIRST_CR,  // 첫 번째 '\r'을 기다리는 상태
    STATE_WAIT_FIRST_LF,  // 첫 번째 '\n'을 기다리는 상태
    STATE_CAPTURING,      // 데이터 캡처(저장) 중인 상태
    STATE_WAIT_SECOND_CR  // 두 번째 '\r'을 기다리는 상태
} ReceiveState;

#define RX_BUFFER_SIZE 128 // 버퍼 크기는 넉넉하게 설정
uint8_t rx_data; // 1바이트 수신 데이터 임시 저장 변수
uint8_t rx_buffer[RX_BUFFER_SIZE]; // 수신 데이터를 저장할 버퍼
volatile uint16_t rx_index = 0; // 버퍼의 현재 위치 (volatile 키워드 추가)
volatile ReceiveState rx_state = STATE_WAIT_FIRST_CR; // 현재 수신 상태 (초기 상태)
volatile uint8_t data_ready = 0; // 데이터 수신 완료 플래그

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MPU_Config(void);
static void MX_GPIO_Init(void);
static void MX_MDMA_Init(void);
static void MX_DMA2D_Init(void);
static void MX_LTDC_Init(void);
static void MX_I2C4_Init(void);
static void MX_OCTOSPI1_Init(void);
static void MX_FMC_Init(void);
static void MX_CRC_Init(void);
static void MX_JPEG_Init(void);
static void MX_SPI2_Init(void);
static void MX_UART4_Init(void);
static void MX_USART1_UART_Init(void);
void StartDefaultTask(void *argument);
extern void TouchGFX_Task(void *argument);
extern void videoTaskFunc(void *argument);
void StartUWB(void *argument);
void StartPathPlanning(void *argument);
void StartPrintDebug(void *argument);

/* USER CODE BEGIN PFP */
static void SDRAM_Initialization_Sequence(SDRAM_HandleTypeDef *hsdram, FMC_SDRAM_CommandTypeDef *Command);


/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MPU Configuration--------------------------------------------------------*/
  MPU_Config();

  /* Enable the CPU Cache */

  /* Enable I-Cache---------------------------------------------------------*/
  SCB_EnableICache();

  /* Enable D-Cache---------------------------------------------------------*/
  SCB_EnableDCache();

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

