lsh1315/UDINGO_STM32/main_stm.c
  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_MDMA_Init();
  MX_DMA2D_Init();
  MX_LTDC_Init();
  MX_I2C4_Init();
  MX_OCTOSPI1_Init();
  MX_FMC_Init();
  MX_CRC_Init();
  MX_JPEG_Init();
  MX_LIBJPEG_Init();
  MX_SPI2_Init();
  MX_UART4_Init();
  MX_USART1_UART_Init();
  MX_TouchGFX_Init();
  /* Call PreOsInit function */
  MX_TouchGFX_PreOSInit();
  /* USER CODE BEGIN 2 */
  SDRAM_Initialization_Sequence(&hsdram1, &command);

  sprintf(str, "\r\n\n\n<<< UDINGO Navi >>>\r\n\n");
  HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), 100);

  // 1. 주차장 식별
  // 실제 시스템에서는 센서 등을 통해 주차장 번호를 자동으로 감지
  lot_number = 1; // 예시로 1번 주차장으로 설정
  sprintf(str, "Parking Lot %d detected.\r\n", lot_number);
  HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), 100);

  // 2. 주차장 지도 정보 로드
  // lot_number에 해당하는 주차장 지도를 동적으로 생성하고 map_matrix에 할당
  // parking_lot.h에 정의된 함수를 사용하여 지도 및 주차 공간 정보 로드
  map_matrix = create_map_copy(lot_number, &map_rows, &map_cols);

  // 3. 사용자 선호도 입력 (향후 GUI로 대체될 부분)
  // 사용자로부터 주차 구역 유형 및 선호 기준을 입력받음
  user_preference[0] = 2;  user_preference[1] = 2;  //디버깅용 선호도 고정

  // 4. 서버와 통신해 비어있는 않은 주차 구역 정보 받아오기 --> 해당 좌표 벽(1)으로
  if(update_parking_occupancy(map_matrix) != 1){
   sprintf(str, "server communiaction error\r\n");
   HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), 100);
   return 0;
  }

  HAL_UART_Receive_IT(&huart4, &rx_data, 1);

//  // map 출력 (디버깅용)
//   for(int i=0; i<map_rows; i++){
//     for(int j=0; j<map_cols; j++){
//       sprintf(str, "%u", map_matrix[i][j]);
//       HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), 100);
//     }
//     sprintf(str, "\r\n");
//     HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), 100);
//   }
//
//  update_current_position(position);  // (현재) 입구로 고정
//
//  find_preferred_parking(user_preference, map_matrix, map_rows, map_cols, goal);
//  path_length = astar(position, goal, map_matrix, map_rows, map_cols, path);
//
//  // 현재위치 출력
//  sprintf(str, "position: (%d, %d)\r\n", position[0], position[1]);
//  HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), 100);
//
//  // 목적지 출력
//  sprintf(str, "goal: (%d, %d)\r\n", goal[0], goal[1]);
//  HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), 100);
//
//  sprintf(str, "path length: %d \r\n", path_length);
//  HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), 100);
//
//  // 경로 출력
//  sprintf(str, "path:\r\n");
//  HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), 100);
//
//  for(int i = 0; i < path_length; i++) {
//  sprintf(str, "(%d, %d) -> ", path[i][0], path[i][1]);
//  HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), 100);
//  }
//
//  sprintf(str, "end!\r\n");
//  HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), 100);

  /* USER CODE END 2 */

  /* Init scheduler */
  osKernelInitialize();

  /* USER CODE BEGIN RTOS_MUTEX */
  /* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
  /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* USER CODE BEGIN RTOS_QUEUES */
  /* add queues, ... */
  /* USER CODE END RTOS_QUEUES */

  /* Create the thread(s) */
  /* creation of defaultTask */
  defaultTaskHandle = osThreadNew(StartDefaultTask, NULL, &defaultTask_attributes);

  /* creation of GUI_Task */
  GUI_TaskHandle = osThreadNew(TouchGFX_Task, NULL, &GUI_Task_attributes);

  /* creation of videoTask */
  videoTaskHandle = osThreadNew(videoTaskFunc, NULL, &videoTask_attributes);

  /* creation of UWB */
  UWBHandle = osThreadNew(StartUWB, NULL, &UWB_attributes);

  /* creation of PathPlanning */
  PathPlanningHandle = osThreadNew(StartPathPlanning, NULL, &PathPlanning_attributes);

  /* creation of PrintDebug */
  PrintDebugHandle = osThreadNew(StartPrintDebug, NULL, &PrintDebug_attributes);

  /* USER CODE BEGIN RTOS_THREADS */
  /* add threads, ... */
  /* USER CODE END RTOS_THREADS */

  /* USER CODE BEGIN RTOS_EVENTS */
  /* add events, ... */
  /* USER CODE END RTOS_EVENTS */

  /* Start scheduler */
  osKernelStart();

  /* We should never get here as control is now taken by the scheduler */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /*AXI clock gating */
  RCC->CKGAENR = 0xE003FFFF;

  /** Supply configuration update enable
  */
  HAL_PWREx_ConfigSupply(PWR_DIRECT_SMPS_SUPPLY);

  /** Configure the main internal regulator output voltage
  */
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE0);

  while(!__HAL_PWR_GET_FLAG(PWR_FLAG_VOSRDY)) {}

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 12;
  RCC_OscInitStruct.PLL.PLLN = 280;
  RCC_OscInitStruct.PLL.PLLP = 2;
  RCC_OscInitStruct.PLL.PLLQ = 2;
  RCC_OscInitStruct.PLL.PLLR = 2;
  RCC_OscInitStruct.PLL.PLLRGE = RCC_PLL1VCIRANGE_1;
  RCC_OscInitStruct.PLL.PLLVCOSEL = RCC_PLL1VCOWIDE;
  RCC_OscInitStruct.PLL.PLLFRACN = 0;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2
                              |RCC_CLOCKTYPE_D3PCLK1|RCC_CLOCKTYPE_D1PCLK1;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.SYSCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB3CLKDivider = RCC_APB3_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_APB2_DIV1;
  RCC_ClkInitStruct.APB4CLKDivider = RCC_APB4_DIV1;

