lsh1315/UDINGO_STM32/main_stm.c
  /* Send the command */
  HAL_SDRAM_SendCommand(hsdram, Command, SDRAM_TIMEOUT);

  /* Step 5: Program the external memory mode register */
  tmpmrd = (uint32_t)SDRAM_MODEREG_BURST_LENGTH_1          |
                     SDRAM_MODEREG_BURST_TYPE_SEQUENTIAL   |
                     SDRAM_MODEREG_CAS_LATENCY_2           |
                     SDRAM_MODEREG_OPERATING_MODE_STANDARD |
                     SDRAM_MODEREG_WRITEBURST_MODE_SINGLE;

  Command->CommandMode = FMC_SDRAM_CMD_LOAD_MODE;
  Command->CommandTarget = FMC_SDRAM_CMD_TARGET_BANK2;
  Command->AutoRefreshNumber = 1;
  Command->ModeRegisterDefinition = tmpmrd;

  /* Send the command */
  HAL_SDRAM_SendCommand(hsdram, Command, SDRAM_TIMEOUT);

  /* Step 6: Set the refresh rate counter */
  /* Set the device refresh rate */
  HAL_SDRAM_ProgramRefreshRate(hsdram, REFRESH_COUNT); 

}

/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void *argument)
{
  /* USER CODE BEGIN 5 */

  /* Infinite loop */
  for(;;)
  {
    osDelay(100);
  }
  /* USER CODE END 5 */
}

/* USER CODE BEGIN Header_StartUWB */
/**
* @brief Function implementing the UWB thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartUWB */
void StartUWB(void *argument)
{
  /* USER CODE BEGIN StartUWB */
  /* Infinite loop */
  for(;;)
  {
    if(HAL_UART_Transmit(&huart1, (uint8_t*)"\r\n-------- UWB --------\r\n", 28, 100) != HAL_OK){
    Error_Handler();
    }
    // 5-1. 현재 위치 업데이트
    // position_detection.h에 정의된 함수를 사용하여 현재 위치를 업데이트
    //  position[0] = 58, position[1] = 25; // 입구 (디버깅용: 특정 위치로 고정)
    //update_current_position(position);  // (현재) 입구로 고정

    uint8_t original_position[2];
    int dist[4] = {0,};

    receive_dwm1000_distances(dist);
    sprintf(str, "qwer: %s\r\n", rx_buffer);
    HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), 100);

    // Debuging print
    sprintf(str, "%d mm | %d mm | %d mm | %d mm\r\n", dist[0],dist[1],dist[2],dist[3]);
    HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), 100);

    // position_detecting and debuging print
    trilaterate(dist, original_position);
    sprintf(str, "Position(cm) : (%d, %d) ", original_position[0], original_position[1]);
    HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), 100);


    // correction to coordinates on path
    correction(original_position, position);
    sprintf(str, "---> (%d, %d)\r\n", position[0],position[1]);
    HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), 100);

    osDelay(5000);
  }
  /* USER CODE END StartUWB */
}

/* USER CODE BEGIN Header_StartPathPlanning */
/**
* @brief Function implementing the PathPlanning thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartPathPlanning */
void StartPathPlanning(void *argument)
{
  /* USER CODE BEGIN StartPathPlanning */
  /* Infinite loop */
  for(;;)
  {
    if(HAL_UART_Transmit(&huart1, (uint8_t*)"\r\n---- PathPlanning ----\r\n", 28, 100) != HAL_OK){
    Error_Handler();
    }
    // 5-2. 최적의 주차 공간 탐색 및 경로 계획
    // find_preferred_parking: 사용자 선호도에 따라 최적의 빈 주차 공간(goal)을 탐색
    // astar: 현재 위치(position)에서 목적지(goal)까지의 최적 경로(path)를 A* 알고리즘으로 계산
    // 경로의 길이를 반환하며, goal과 path는 전역변수에 저장됨
    find_preferred_parking(user_preference, map_matrix, map_rows, map_cols, goal);
    path_length = astar(position, goal, map_matrix, map_rows, map_cols, path);
    // ★ TouchGFX Model로 추천 좌표 전달
    gui_update_recommended_parking((int)goal[0], (int)goal[1]); // 수정된 코드
    gui_update_path_points((uint8_t*)path, path_length);
    osDelay(5000);
  }
  /* USER CODE END StartPathPlanning */
}

/* USER CODE BEGIN Header_StartPrintDebug */
/**
* @brief Function implementing the PrintDebug thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartPrintDebug */
void StartPrintDebug(void *argument)
{
  /* USER CODE BEGIN StartPrintDebug */
  /* Infinite loop */
  for(;;)
  {
    if(HAL_UART_Transmit(&huart1, (uint8_t*)"\r\n-------- GUI --------\r\n", 28, 100) != HAL_OK){
    Error_Handler();
    }

    // 5-3. 결과 출력 (향후 GUI로 대체될 부분)

    // 현재위치 출력
    sprintf(str, "position: (%d, %d)\r\n", position[0], position[1]);
    HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), 100);

    // 목적지 출력
    sprintf(str, "goal: (%d, %d)\r\n", goal[0], goal[1]);
    HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), 100);

    // 경로 출력
    sprintf(str, "path:\r\n");
    HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), 100);

    for(int i = 0; i < path_length; i++) {
      sprintf(str, "(%d, %d) -> ", path[i][0], path[i][1]);
      HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), 100);
    }

    sprintf(str, "end!\r\n");
    HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), 100);

    osDelay(3000);
  }
  /* USER CODE END StartPrintDebug */
}

 /* MPU Configuration */

void MPU_Config(void)
{
  MPU_Region_InitTypeDef MPU_InitStruct = {0};

  /* Disables the MPU */
  HAL_MPU_Disable();

  /** Initializes and configures the Region and the memory to be protected
  */
  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER0;
  MPU_InitStruct.BaseAddress = 0x90000000;
  MPU_InitStruct.Size = MPU_REGION_SIZE_256MB;
  MPU_InitStruct.SubRegionDisable = 0x0;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
  MPU_InitStruct.AccessPermission = MPU_REGION_NO_ACCESS;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_DISABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_NOT_SHAREABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /** Initializes and configures the Region and the memory to be protected
  */
  MPU_InitStruct.Number = MPU_REGION_NUMBER1;
  MPU_InitStruct.Size = MPU_REGION_SIZE_64MB;
  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_CACHEABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

